// ㅜ르다, ㅣ르다 => #ㅣㄹ러 ) 무찌르 => 무찔러, 기르 => 길러,
// #-ㅡ => ㅏ- -ㅏ ) 마르다 => 말 라, 모르다 => 몰 라
// -ㅡ => -ㅓ ) 뜨 => 떠
// ㅔ, ㅚ, ㅓ/받침 ㅐ, ㅜ, ㅜ/받침, ㅣ + 어
// ㅗ/ㅂ받침 + 와 ) 돕 => 도와 (불규칙)
// ㅗ/ㄹ받침 + ㅏ ) 몰 => 몰아
// -ㅣ => -ㅕ ) 디 => 뎌, 미치 => 미쳐, 망치 => 망쳐
// 무찌르다, 무찔러
// 기르다, 길러
// 가로지르다, 가로질러
// 머무르다, 머물러
// 게으르다, 게을러
// 이르다, 일러 ) ㅡ,ㅣ,ㅜ에 받침이 생기고 자음 + ㅓ가 된다.
// 고르다, 골라
// 마르다, 말라
// 모르다, 몰라
// 빠르다, 빨라
// 바르다, 발라
// 자르다, 잘라
// ㅗ,ㅏ 에 받침이 생기고 자음 + ㅏ가 된다.
// 따르다, 따라 (예외 불규칙 변형)
//
export const verbs = {
    ㄱ: {
        ㅏ: [
            '가누다',
            '가두다',
            '가루다',
            '가르다',
            '가물다',
            '가시다',
            '가지다',
            '각치다',
            '갈라지다',
            '갉다',
            '갖다',
            '갚다',
        ],
        ㅐ: ['개개다', '개기다', '개다'],
        ㅑ: ['갸울다'],
        ㅓ: [
            '거누다',
            '거두다',
            '거들다',
            '거치다',
            '건너다',
            '건네다',
            '건드리다',
            '걷다',
        ],
        ㅕ: ['견주다', '겯다'],
        ㅖ: ['계시다'],
        ㅗ: ['고기다', '곪다', '곯다', '곱다'],
        ㅚ: ['괴다'],
        ㅜ: ['구기다', '구르다', '굳다', '굶다', '굻다', '굽다'],
        ㅡ: ['그리다', '긁다', '긋다'],
        ㅣ: ['기다', '기다리다', '기르다', '기울다', '깃다'],
    },
};
//# sourceMappingURL=verbs.js.map